IDENTIFICATION DIVISION.
PROGRAM-ID. LOOPCOVERAGE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 E-FELDER.
  05 FAC PIC 9999 VALUE ZERO.
01 V-FELDER.
  05 ERG PIC 9999 VALUE 1.
  05 I PIC 9999.
PROCEDURE DIVISION.
B100.

PERFORM B100 AFTER ZAHL1 FROM 1 BY 1 UNTIL ZAHL1 = 100
   AFTER ZAHL2 FROM 1 BY 2 UNTIL ZAHL2 = 100.

PERFORM B100 UNTIL FAC = 9.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > FAC
  COMPUTE ERG = ERG * I
END-PERFORM.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > FAC WITH TEST BEFORE
  COMPUTE ERG = ERG * I
END-PERFORM.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > FAC WITH TEST AFTER
  COMPUTE ERG = ERG * I
END-PERFORM.

STOP RUN.
