IDENTIFICATION DIVISION.
PROGRAM-ID. STARTTESTCASE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
LINKAGE SECTION.
01 TEST-CASE-1 PIC X(50).
PROCEDURE DIVISION USING TEST-CASE-1.
END PROGRAM STARTTESTCASE.