IDENTIFICATION DIVISION.
PROGRAM-ID. STATEMENTCOVERAGE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 E-FELDER.
  05 FAC PIC 9999 VALUE ZERO.
01 V-FELDER.
  05 ERG PIC 9999 VALUE 1.
  05 I PIC 9999.
PROCEDURE DIVISION.
B100.


ADD ZAHL1 TO ZAHL2.

COMPUTE ERG = ERG * I

DISPLAY "FACULTY: " ERG

GO TO B100.

GOBACK.

CALL "subprogram".

EVALUATE FAC
  WHEN 0 DISPLAY "a thing".

EXIT PROGRAM.

PERFORM B100 UNTIL FAC = 9.

IF FAC = 0 DISPLAY "if".

STOP RUN.
